clojure/clojure-keybindings.org
# -*- in-config-file: t; lexical-binding: t  -*-

* Clojure Keybindings


| command               | function                                      |
|-----------------------+-----------------------------------------------|
| REPL                  |                                               |
|-----------------------+-----------------------------------------------|
| ,ss                   | Spawn REPL                                    |
| ,sb                   | Send entire buffer to shell (run first)       |
| ,se                   | Evaluate sexp before point in REPL            |
| ,sr                   | Evaluate Region                               |
| ,sf                   | Eval defun at point                           |
| ,sq                   | Quit repl                                     |
|-----------------------+-----------------------------------------------|
| Project/namespace/etc |                                               |
|-----------------------+-----------------------------------------------|
| ,pl                   | Spawn REPL                                    |
| ,pr                   | Refresh namespace (and hence basically cider) |
|-----------------------+-----------------------------------------------|
| Help                  |                                               |
|-----------------------+-----------------------------------------------|
| ,hl                   | Local documentation for symbol                |
| ,hd                   | Clojuredocs documentation for symbol          |
|                       |                                               |


#+BEGIN_SRC emacs-lisp

(mode-binding 
:states '(normal motion)
:keymaps 'clojure-mode-map
"s" '(:ignore t :which-key "Talk to REPL")
"ss" '(cider-jack-in :which-key "Spawn REPL")
"sb" '(cider-load-buffer :which-key "Load and eval entire buffer")
"se" 'cider-eval-last-sexp-to-repl
"sr" 'cider-eval-region
"sf" 'cider-eval-defun-at-point
"sq" 'cider-quit
"p" '(:ignore t :which-key "Project-wide commands")
"pl" '(cider-load-all-files :which-key "Load every file in directory")
"pr" 'cider-ns-refresh
"h" '(:ignore t :which-key "Help")
"hl" 'cider-doc
"hd" 'cider-clojuredocs
)

#+END_SRC
